
--
-- テーブルのデータのダンプ author
--



INSERT INTO author (author_id, first_name, last_name) VALUES
(1, '佐々木', '蔵之介'),
(2, '西島', '秀俊'),
(3, '香川', '照之'),
(4, '谷原', '章介');

-- --------------------------------------------------------


--
-- テーブルのデータのダンプ book
--

INSERT INTO book (book_id, price, title) VALUES
(10, 2000, 'java入門'),
(11, 4000, 'テスト駆動開発入門'),
(12, 2000, 'spring入門'),
(13, 1500, 'sassの教科書'),
(14, 5500, 'Gradle入門'),
(15, 1400, 'アルゴリズムの基本'),
(16, 1000, 'はじめてのnode.js'),
(17, 3900, 'はじめてのbackbone.js'),
(18, 2300, 'java8プログラミング'),
(19, 3200, 'spring roo 実践入門');

-- --------------------------------------------------------


--
-- テーブルのデータのダンプ book_authors
--

INSERT INTO book_authors (books_bookId, authors_authorId) VALUES
(10, 1),
(11, 1),
(13, 1),
(15, 1),
(10, 2),
(12, 2),
(14, 2),
(17, 2),
(18, 2),
(15, 3),
(19, 3),
(16, 4),
(17, 4),
(19, 4);

-- --------------------------------------------------------

